spoemb/linkit-v4-core/ports/nrf52840/main.cpp
extern "C" void HardFault_Handler() {
#ifdef NDEBUG
	for (;;) { PMU::save_stack(PMULogType::HARDFAULT); PMU::reset(false); }
#else
	fault_blink_loop(RGBLedColor::RED);
#endif
}

extern "C" void MemoryManagement_Handler(void) {
#ifdef NDEBUG
	for (;;) { PMU::save_stack(PMULogType::MMAN); PMU::reset(false); }
#else
	fault_blink_loop(RGBLedColor::YELLOW);
#endif
}

extern "C" {
	/// @brief Stack canary value for -fstack-protector.  Fixed constant — see review note.
	void *__stack_check_guard = (void*)0xDEADBEEF;
	/// @brief Called by -fstack-protector when the canary is corrupted.
	void __wrap___stack_chk_fail(void) {
#ifdef NDEBUG
		PMU::save_stack(PMULogType::STACK);
		PMU::reset(false);
#else
		fault_blink_loop(RGBLedColor::MAGENTA);
#endif
	}
}

extern "C" void vApplicationMallocFailedHook() {
#ifdef NDEBUG
	for (;;) { PMU::save_stack(PMULogType::MALLOC); PMU::reset(false); }
#else
	fault_blink_loop(RGBLedColor::CYAN);
#endif
}

/** @brief ETL library error callback — logs the exception then resets or blinks. */
void etl_error_handler(const etl::exception& e)
{
	DEBUG_TRACE("ETL error: %s in %s : %u", e.what(), e.file_name(), e.line_number());
#ifdef NDEBUG
	for (;;) { PMU::save_stack(PMULogType::ETL); PMU::reset(false); }
#else
	fault_blink_loop(RGBLedColor::RED, 200);
#endif
}

/**
 * @brief Low-level write override — routes stdout/printf to the active debug channel.
 *
 * Overrides the weak newlib _write() so that printf / std::cout output is directed
 * to UART, USB CDC, or BLE NUS depending on g_debug_mode.
 *
 * @note Safe to call from ISR context only for UART and USB CDC paths.
 *       BLE NUS path checks __get_IPSR() and skips if in interrupt context.
 */
extern "C" int _write(int file, char *ptr, int len)
{
#ifdef DEBUG_UART_TX_PIN
	if (g_debug_mode == BaseDebugMode::UART && NrfDebugUart::is_init())
		NrfDebugUart::write(ptr, len);
	else
#endif
	if (g_debug_mode == BaseDebugMode::USB_CDC && m_is_debug_init)
		NrfUSB::write(ptr, len);
	else if (ble_service && !__get_IPSR() && g_debug_mode == BaseDebugMode::BLE_NUS) {
		ble_service->write_best_effort(std::string(ptr, len));
	}
	return len;
}


// ═══════════════════════════════════════════════════════════════
// Init sub-functions
//
// Each phase creates static objects (in .bss/.data) and assigns
// global pointers.  This keeps main() readable and reduces its
// stack frame — static objects are visible in the linker map.
// ═══════════════════════════════════════════════════════════════

/** @brief References returned by init_peripherals() for use in subsequent init phases. */
struct InitContext {
	NrfSwitch& reed;   ///< Reed switch — needed by power-on check, gesture, and dive mode
	Is25Flash& flash;   ///< External NOR flash — needed by LFS and OTA updater
};

/**
 * @brief Phase 1 — Initialise core peripherals.
 *
 * Sets up: PMU, watchdog, GPIO, RTC, hardware timer, debug output (UART/USB/BLE),
 * NFC pin check, RGB LED, external LED, reed switch, buzzer, BLE stack, IS25 flash.
 *
 * @return InitContext with references to reed switch and flash for subsequent phases.
 */
static InitContext init_peripherals()
{
	PMU::initialise();
#ifndef DEBUG_NO_WATCHDOG
	PMU::start_watchdog();
	PMU::kick_watchdog();
#endif
	GPIOPins::initialise();
	etl::error_handler::set_callback<etl_error_handler>();

	rtc = &NrfRTC::get_instance();
	NrfRTC::get_instance().init();

	DEBUG_TRACE("Timer...");
	system_timer = &NrfTimer::get_instance();
	NrfTimer::get_instance().init();

	// Init debug output (UART, USB CDC, BLE, or NONE)
	m_is_debug_init = true;
	static ConsoleLog console_log;
	if (g_debug_mode == BaseDebugMode::NONE) {
		DebugLogger::console_log = nullptr;
	} else {
		DebugLogger::console_log = &console_log;
#ifdef DEBUG_UART_TX_PIN
		if (g_debug_mode == BaseDebugMode::UART) {
			NrfDebugUart::init(DEBUG_UART_TX_PIN);
		} else
#endif
		{
			NrfUSB::init();
		}
	}
	setvbuf(stdout, NULL, _IONBF, 0);
	nrf_log_redirect_init();

	// Verify NFC pins are configured as GPIO (P0.09/P0.10 used for SPI CS and SWS_OUT)
	{
		uint32_t nfcpins = NRF_UICR->NFCPINS;
		if ((nfcpins & UICR_NFCPINS_PROTECT_Msk) == (UICR_NFCPINS_PROTECT_NFC << UICR_NFCPINS_PROTECT_Pos)) {
			DEBUG_ERROR("UICR: NFC pins still in NFC mode (0x%08X) — P0.09/P0.10 unusable as GPIO!", nfcpins);
		} else {
			DEBUG_INFO("UICR: NFC pins configured as GPIO (0x%08X)", nfcpins);
		}
	}

	DEBUG_TRACE("RGB LED...");
	static NrfRGBLed nrf_status_led("STATUS", BSP::GPIO::GPIO_LED_RED, BSP::GPIO::GPIO_LED_GREEN, BSP::GPIO::GPIO_LED_BLUE, RGBLedColor::WHITE);
	status_led = &nrf_status_led;

#ifdef EXT_LED_PIN
	DEBUG_TRACE("External LED...");
	static GPIOLed gpio_led(EXT_LED_PIN);
	ext_status_led = &gpio_led;
#else
	ext_status_led = nullptr;
#endif

	if (ext_status_led)
		ext_status_led->off();

	DEBUG_TRACE("Reed switch...");
	static NrfSwitch nrf_reed_switch(BSP::GPIO::GPIO_REED_SW, REED_SWITCH_DEBOUNCE_TIME_MS, REED_SWITCH_ACTIVE_STATE);

#ifdef BUZZER_EN_PIN
	DEBUG_TRACE("Buzzer...");
	static Buzzer buzzer(BUZZER_EN_PIN);
	buzzer_ctl = &buzzer;
#else
	buzzer_ctl = nullptr;
#endif

	DEBUG_TRACE("BLE...");
	BleInterface::get_instance().init();

	DEBUG_TRACE("IS25 flash...");
	static Is25Flash is25_flash;
	is25_flash.init();

	return {nrf_reed_switch, is25_flash};
}


/**
 * @brief Phase 2 — Power-on reed switch gesture check.
 *
 * On power-on reset, the user must hold a magnet on the reed switch for 3 seconds
 * to confirm intentional boot.  Without this gesture the device powers down
 * immediately, preventing accidental wake from battery insertion or transient
 * power glitches.
 *
 * Two code paths depending on board type:
 *  - PSEUDO_POWER_OFF (LinkIt V4): timer-based, handles both real and pseudo power-on.
 *  - Non-PSEUDO (RSPB): simple polling countdown for true power-on reset only.
 *
 * @param nrf_reed_switch  Hardware reed switch instance for state/callback registration.
 */
static void init_power_on_check(NrfSwitch& nrf_reed_switch)
{
	DEBUG_TRACE("PMU Reset Cause = %s", PMU::reset_cause_str());

#ifdef POWER_ON_RESET_REQUIRES_REED_SWITCH
#ifdef PSEUDO_POWER_OFF
	// PSEUDO_POWER_OFF (LinkIt V4): The nRF52 has no true power switch — it uses
	// VSYS_SEL to latch its own supply via a load switch. "Power off" is a soft
	// shutdown (System OFF mode) with VSYS_SEL de-asserted. A reed switch GPIO
	// event wakes the chip, which sees "Pseudo Power On Reset" instead of a real
	// "Power On Reset". This branch handles both reset causes.
	{
		SensorsPowerGuard power_guard;
		NrfI2C::init();
		PMU::hardware_version(); // Side-effect: I2C probes for hardware detection
#if ENABLE_SEA_TEMP_SENSOR
		{
			try {
				EZO_RTD_Sensor rtd; // Puts the device into standby mode
			} catch (...) {}
		}
#endif
		NrfI2C::uninit();
	}
	bool is_linkit_v4 = (PMU::hardware_version() == "LinkIt V4");

