spoemb/linkit-v4-core/ports/nrf52840/main.cpp
	DEBUG_TRACE("RAM access...");
	static NrfMemoryAccess nrf_memory_access;
	memory_access = &nrf_memory_access;

	DEBUG_TRACE("DTE handler...");
	static DTEHandler dte_handler_local;
	dte_handler = &dte_handler_local;

	DEBUG_TRACE("OTA updater...");
	ble_service = &BleInterface::get_instance();
	static OTAFlashFileUpdater ota_flash_file_updater(&lfs_file_system, &is25_flash, IS25_BLOCK_COUNT - OTA_UPDATE_RESERVED_BLOCKS, OTA_UPDATE_RESERVED_BLOCKS);
	ota_updater = &ota_flash_file_updater;
}


/**
 * @brief Phase 6 — Communication backends and GPS.
 *
 * Initialises the salt-water switch (SWS) service, the satellite/LoRa TX backend
 * (mutually exclusive: SMD, KIM2, or LoRa RAK3172), and the GNSS receiver (M10Q).
 * Each backend's log file is created here alongside the device.
 *
 * @param lfs_file_system  Mounted filesystem for sensor.log and SWS log.
 */
static void init_communication(LFSFileSystem& lfs_file_system)
{
#if ENABLE_SWS_ANALOG
	DEBUG_INFO(">> Creating services...");
	static SWSAnalogService sws_analog;

#if ENABLE_SWS_LOG
	DEBUG_TRACE("SWS Log...");
	static SWSLogFormatter sws_log_formatter;
	static FsLog sws_log(&lfs_file_system, "SWS", 1024*1024);
	sws_log.set_log_formatter(&sws_log_formatter);
	SWSAnalogService::set_sws_logger(&sws_log);
#endif
#endif

#if defined(LORA_RAK3172) && (LORA_RAK3172 == 1)
	DEBUG_TRACE("LoRa RAK3172...");
	try {
		static LoRaDevice lora_rak3172;
		lora_device_instance = &lora_rak3172;
		static LoRaTxService lora_tx_service(lora_rak3172);
	} catch (...) {
		DEBUG_INFO("LoRa RAK3172 not detected");
		lora_device_instance = nullptr;
	}
#elif defined(ARGOS_SMD) && (ARGOS_SMD == 1)
	DEBUG_TRACE("SMD Satellite...");
	try {
#if defined(SMD_UART) && (SMD_UART == 1)
		static SmdSatCmdAt smd_cmd;
#else
		static SmdSatCmdSpi smd_cmd;
#endif
		static SmdSat argos_smd(smd_cmd);
		smd_sat_instance = &argos_smd;  // Store pointer for SMD DFU OTA
		kineis_device_instance = &argos_smd;
		static ArgosTxService argos_tx_service(argos_smd);
	} catch (...) {
		DEBUG_INFO("SMD not detected");
		smd_sat_instance = nullptr;
		kineis_device_instance = nullptr;
	}
#else
	DEBUG_TRACE("KIM2...");
	try {
		static KIM2Device kim2;
		kineis_device_instance = &kim2;
		static ArgosTxService argos_tx_service(kim2);
	} catch (...) {
		DEBUG_INFO("KIM2 not detected");
		kineis_device_instance = nullptr;
	}
#endif

	DEBUG_TRACE("GPS M10Q ...");
	static GPSLogFormatter fs_sensor_log_formatter;
	static FsLog fs_sensor_log(&lfs_file_system, "sensor.log", 1024*1024);
	fs_sensor_log.set_log_formatter(&fs_sensor_log_formatter);

	try {
		static M10QAsyncReceiver m10q_gnss;
		gps_device = &m10q_gnss;
		static GPSService gps_service(m10q_gnss, &fs_sensor_log);
	} catch (...) {
		DEBUG_INFO("GPS M10Q not detected");
	}
}


/**
 * @brief Phase 7 — Sensor detection, log creation, and service registration.
 *
 * Auto-detects I2C sensors (pressure, CDT, ALS, pH, sea temperature, accelerometer,
 * thermistor, camera) and creates their log files and SensorService instances.
 * Pressure sensor detection uses placement new into static aligned storage to avoid
 * heap allocation.  Each sensor that fails detection logs an INFO and is skipped.
 *
 * @param lfs_file_system  Mounted filesystem for per-sensor log files.
 */
static void init_sensors(LFSFileSystem& lfs_file_system)
{
#if ENABLE_PRESSURE_SENSOR || ENABLE_CDT_SENSOR
	DEBUG_TRACE("Pressure Sensor...");
	PressureSensorDevice *pressure_sensor_devices[BSP::I2C_TOTAL_NUMBER] = {nullptr};
#ifndef DUMMY_PRESSURE_SENSOR
	// Static storage for pressure sensors — one per I2C bus, no heap allocation
	using PressureStorage = std::aligned_union_t<0, LPS28DFW, Bar100, MS58xxLL>;
	static PressureStorage pressure_storage[BSP::I2C_TOTAL_NUMBER];

	// Sensor detection order — LPS28DFW is default for RSPB board
#if defined(BOARD_RSPB)
	static constexpr unsigned int i2caddr[4] = { LPS28DFW_ADDRESS, MS5803_ADDRESS, MS5837_ADDRESS, BAR100_ADDRESS };
	static const char* const variant[4] = { "LPS28DFW", MS5803_VARIANT, MS5837_VARIANT, "BAR100-R3-RP" };
#else
#ifndef LPS28DFW_ADDRESS
#define LPS28DFW_ADDRESS 0x5C
#endif
	static constexpr unsigned int i2caddr[4] = { MS5803_ADDRESS, MS5837_ADDRESS, BAR100_ADDRESS, LPS28DFW_ADDRESS };
	static const char* const variant[4] = { MS5803_VARIANT, MS5837_VARIANT, "BAR100-R3-RP", "LPS28DFW" };
#endif

	for (unsigned int i = 0; i < BSP::I2C_TOTAL_NUMBER; i++) {
		for (unsigned int j = 0; j < 4; j++) {
			try {
				PressureSensorDevice *device;
#if defined(BOARD_RSPB)
				if (j == 0) {
					device = new (&pressure_storage[i]) LPS28DFW(i, i2caddr[j]);
				} else if (j == 3) {
					device = new (&pressure_storage[i]) Bar100(i, i2caddr[j]);
				} else {
					device = new (&pressure_storage[i]) MS58xxLL(i, i2caddr[j], variant[j]);
				}
#else
				if (j == 2) {
					device = new (&pressure_storage[i]) Bar100(i, i2caddr[j]);
				} else if (j == 3) {
					device = new (&pressure_storage[i]) LPS28DFW(i, i2caddr[j]);
				} else {
					device = new (&pressure_storage[i]) MS58xxLL(i, i2caddr[j], variant[j]);
				}
#endif
				pressure_sensor_devices[i] = device;
				DEBUG_TRACE("%s: found on i2cbus=%u i2caddr=0x%02x", variant[j], i, i2caddr[j]);
				break;
			} catch (...) {
				DEBUG_INFO("Nothing detected on i2cbus=%u i2caddr=0x%02x", i, i2caddr[j]);
				pressure_sensor_devices[i] = nullptr;
			}
		}
	}
#else
	static PressureSensorDummyDevice dummy_pressure;
	pressure_sensor_devices[0] = &dummy_pressure;
#endif

#if ENABLE_CDT_SENSOR
	DEBUG_TRACE("AD5933...");
	AD5933 *ad5933_devices[BSP::I2C_TOTAL_NUMBER];
	static std::aligned_union_t<0, AD5933LL> ad5933_storage[BSP::I2C_TOTAL_NUMBER];
	for (unsigned int i = 0; i < BSP::I2C_TOTAL_NUMBER; i++) {
		try {
			ad5933_devices[i] = new (&ad5933_storage[i]) AD5933LL(i, AD5933_ADDRESS);
			DEBUG_TRACE("AD5933: found on i2cbus=%u i2caddr=0x%02x", i, AD5933_ADDRESS);
		} catch (...) {
			DEBUG_INFO("AD5933: not detected on i2cbus=%u i2caddr=0x%02x", i, AD5933_ADDRESS);
			ad5933_devices[i] = nullptr;
		}
	}

