spoemb/linkit-v4-core/ports/nrf52840/main.cpp
	static CDTLogFormatter cdt_sensor_log_formatter;
	static FsLog cdt_sensor_log(&lfs_file_system, "CDT", 1024*1024);
	cdt_sensor_log.set_log_formatter(&cdt_sensor_log_formatter);
#endif

#if ENABLE_PRESSURE_SENSOR
	static PressureLogFormatter pressure_sensor_log_formatter;
	static FsLog pressure_sensor_log(&lfs_file_system, "PRESSURE", 1024*1024);
	pressure_sensor_log.set_log_formatter(&pressure_sensor_log_formatter);
#endif

	bool cdt_present = false;
	bool standalone_pressure = false;
	// Iterate twice to allow flags to be set
	for (unsigned int x = 0; x < 2; x++) {
		for (unsigned int i = 0; i < BSP::I2C_TOTAL_NUMBER; i++) {
#if ENABLE_CDT_SENSOR
			if (!cdt_present && ad5933_devices[i] && pressure_sensor_devices[i]) {
				DEBUG_TRACE("CDT on bus %u...", i);
				cdt_present = true;
				static CDT cdt(*pressure_sensor_devices[i], *ad5933_devices[i]);
				static CDTSensorService cdt_sensor_service(cdt, &cdt_sensor_log);
			} else
#endif
#if ENABLE_PRESSURE_SENSOR
			if (!standalone_pressure && pressure_sensor_devices[i]) {
				DEBUG_TRACE("Standalone Pressure Sensor on bus %u...", i);
				standalone_pressure = true;
				static PressureSensor pressure_sensor(*pressure_sensor_devices[i]);
				static PressureSensorService pressure_sensor_service(pressure_sensor, &pressure_sensor_log);
			}
#endif
			(void)i; // Suppress unused warning when both disabled
		}

		if (standalone_pressure && cdt_present)
			break;
	}
#endif // ENABLE_PRESSURE_SENSOR || ENABLE_CDT_SENSOR

#if ENABLE_ALS_SENSOR
	DEBUG_TRACE("LTR303...");
	static ALSLogFormatter als_sensor_log_formatter;
	static FsLog als_sensor_log(&lfs_file_system, "ALS", 1024*1024);
	als_sensor_log.set_log_formatter(&als_sensor_log_formatter);
	try {
		static LTR303 ltr303;
		static ALSSensorService als_sensor_service(ltr303, &als_sensor_log);
	} catch (...) {
		DEBUG_INFO("LTR303: not detected");
	}
#endif

#if ENABLE_PH_SENSOR
	DEBUG_TRACE("OEM PH...");
	static PHLogFormatter ph_sensor_log_formatter;
	static FsLog ph_sensor_log(&lfs_file_system, "PH", 1024*1024);
	ph_sensor_log.set_log_formatter(&ph_sensor_log_formatter);
	try {
		static OEM_PH_Sensor ph;
		static PHSensorService ph_sensor_service(ph, &ph_sensor_log);
	} catch (...) {
		DEBUG_INFO("OEM PH: not detected");
	}
#endif

#if ENABLE_SEA_TEMP_SENSOR
	static SeaTempLogFormatter rtd_sensor_log_formatter;
	static FsLog rtd_sensor_log(&lfs_file_system, "RTD", 1024*1024);
	rtd_sensor_log.set_log_formatter(&rtd_sensor_log_formatter);

	DEBUG_TRACE("EZO RTD...");
	try {
		static EZO_RTD_Sensor rtd;
		static SeaTempSensorService rtd_sensor_service(rtd, &rtd_sensor_log);
	} catch (ErrorCode e) {
		DEBUG_INFO("EZO RTD: not detected [%04X]", e);
	}

	static SeaTempLogFormatter tsys01_sensor_log_formatter;
	static FsLog tsys01_sensor_log(&lfs_file_system, "TSYS01", 1024*1024);
	tsys01_sensor_log.set_log_formatter(&tsys01_sensor_log_formatter);

	DEBUG_TRACE("TSYS01...");
	try {
		static TSYS01 tsys01;
		static SeaTempSensorService tsys01_sensor_service(tsys01, &tsys01_sensor_log);
	} catch (ErrorCode e) {
		DEBUG_INFO("TSYS01: not detected [%04X]", e);
	}
#endif

#if ENABLE_AXL_SENSOR
	DEBUG_TRACE("BMA400...");
	static AXLLogFormatter axl_sensor_log_formatter;
	static FsLog axl_sensor_log(&lfs_file_system, "AXL", 1024*1024);
	axl_sensor_log.set_log_formatter(&axl_sensor_log_formatter);
	try {
		static BMA400 bma400;
		static AXLSensorService axl_sensor_service(bma400, &axl_sensor_log);
	} catch (...) {
		DEBUG_INFO("BMA400: not detected");
	}
#endif

#if ENABLE_THERMISTOR_SENSOR
	DEBUG_TRACE("Thermistor NTC...");
	static ThermistorLogFormatter thermistor_sensor_log_formatter;
	static FsLog thermistor_sensor_log(&lfs_file_system, "THERMISTOR", 1024*1024);
	thermistor_sensor_log.set_log_formatter(&thermistor_sensor_log_formatter);
	try {
		static Thermistor thermistor(THERMISTOR_ADC);
		static ThermistorSensorService thermistor_sensor_service(thermistor, &thermistor_sensor_log);
	} catch (...) {
		DEBUG_INFO("Thermistor: not detected");
	}
#endif

#ifdef CAM_PWR_EN
	DEBUG_TRACE("RunCam...");
	static CAMLogFormatter cam_sensor_log_formatter;
	static FsLog cam_sensor_log(&lfs_file_system, "CAM", 1024*1024);
	cam_sensor_log.set_log_formatter(&cam_sensor_log_formatter);
	try {
		static RunCam run_cam;
		static CAMService cam_service(run_cam, &cam_sensor_log);
	} catch (...) {
		DEBUG_INFO("RunCam: not detected");
	}
#endif

#if ENABLE_MORTALITY_SENSOR
	DEBUG_TRACE("Mortality detection...");
	static MortalityLogFormatter mortality_log_formatter;
	static FsLog mortality_log(&lfs_file_system, "MORTALITY", 64*1024);
	mortality_log.set_log_formatter(&mortality_log_formatter);
	static MortalityService mortality_svc(&mortality_log);
	mortality_service = &mortality_svc;
#endif

	(void)lfs_file_system; // Suppress unused warning when no sensors enabled
}


/**
 * @brief Phase 8 — Runtime services (memory monitor, dive mode, shutdown timer).
 *
 * Starts background services that run during the operational lifetime:
 *  - MemoryMonitorService: periodic heap/stack usage reporting.
 *  - DiveModeService: reed-switch-triggered dive/surface mode toggle.
 *  - EXTERNAL_WAKEUP shutdown timer: powers down after configured seconds (TPL5111 boards).
 *
 * @param nrf_reed_switch  Hardware reed switch for DiveModeService.
 */
static void init_runtime(NrfSwitch& nrf_reed_switch)
{
	DEBUG_TRACE("Memory monitor...");
	static MemoryMonitorService memory_monitor_service;

	DEBUG_TRACE("Dive mode monitor...");
	static DiveModeService dive_mode_service(nrf_reed_switch);

#ifdef EXTERNAL_WAKEUP
	// TPL5111 shutdown timer — powerdown after SHUTDOWN_TIMER seconds
	{
		unsigned int shutdown_timer = configuration_store->read_param<unsigned int>(ParamID::SHUTDOWN_TIMER);
		if (shutdown_timer > 0) {
			DEBUG_INFO("EXTERNAL_WAKEUP: Shutdown timer scheduled for %u seconds", shutdown_timer);
			system_scheduler->post_task_prio([]() {
				DEBUG_INFO("EXTERNAL_WAKEUP: Shutdown timer expired | powering down");
				PMU::powerdown();
			}, "SHUTDOWN_TIMER", Scheduler::DEFAULT_PRIORITY, shutdown_timer * 1000);
		} else {
			DEBUG_INFO("EXTERNAL_WAKEUP: Shutdown timer disabled (SHUTDOWN_TIMER=0)");
		}
	}
#endif
}


/**
 * @brief Application entry point.
 *
 * Runs the eight init phases in order, starts the GenTracker FSM, then enters
 * the infinite scheduler loop with deep-idle power management.
 *
 * @note This function never returns.  All init-phase objects are static and
 *       live in .bss — the main() stack frame only holds the loop locals.
 */
int main()
{
	auto [reed, flash] = init_peripherals();
	init_power_on_check(reed);
	auto& lfs = init_storage(reed, flash);
	init_battery();
	init_core_services(lfs, flash);
	init_communication(lfs);
	init_sensors(lfs);
	init_runtime(reed);

	DEBUG_TRACE("Entering main SM...");
	GenTracker::start();

	// Deep idle: cut peripheral power rails when no task is due soon.
	static constexpr uint64_t DEEP_IDLE_THRESHOLD_MS = 5000;
	static bool in_deep_idle = false;

	// The scheduler should run forever.  Any run-time exceptions should be handled and passed to FSM.
	while (true)
	{
		try {
#ifdef DEBUG_UART_TX_PIN
			if (g_debug_mode != BaseDebugMode::UART)
#endif
				NrfUSB::process();

			// Exit deep idle BEFORE running scheduler tasks — peripherals
			// need power rail restored before any SPI/I2C/UART access.
			if (in_deep_idle) {
				uint64_t remaining = system_scheduler->ms_until_next_task();
				if (remaining <= DEEP_IDLE_THRESHOLD_MS) {
					PMU::exit_deep_idle();
					in_deep_idle = false;
					DEBUG_TRACE("DEEP_IDLE: exit (%llu ms remaining)", remaining);
				}
			}

			system_scheduler->run();

			// Enter deep idle when no tasks are due for a while
			uint64_t idle_ms = system_scheduler->ms_until_next_task();
			if (idle_ms > DEEP_IDLE_THRESHOLD_MS && !in_deep_idle) {
				DEBUG_TRACE("DEEP_IDLE: enter (%llu ms idle)", idle_ms);
				in_deep_idle = true;
				PMU::enter_deep_idle();
			}

			// Safety watchdog kick — reduces dependency on scheduled task
			PMU::kick_watchdog();

			PMU::run();
		} catch (ErrorCode e) {
			ErrorEvent event;
			event.error_code = e;
			GenTracker::dispatch(event);
		}
	}
}
